app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `tb_products`
SELECT COUNT(*) AS `numrows`
FROM `tb_products`
WHERE `stock` <= min_stock
SELECT `id`, `name`, `stock`, `min_stock`
FROM `tb_products`
WHERE `stock` <= min_stock
ORDER BY `stock` ASC
 LIMIT 5
---
    private function getDashboardStats(): array
    {
        $stats = [
            'products'          => 0,
            'transactionsToday' => 0,
            'lowStock'          => 0,
            'customers'         => 0,
            'monthlyLabels'     => [],
            'monthlyTotals'     => [],
            'lowStockItems'     => [],
            'recentTransactions' => [],
        ];

        try {
            $db = Database::connect();

            if ($db->tableExists('tb_products')) {
                $stats['products'] = (int) $db->table('tb_products')->countAllResults();

                $fields = $db->getFieldNames('tb_products');
                if (in_array('stock', $fields, true) && in_array('min_stock', $fields, true)) {
                    $stats['lowStock'] = (int) $db->table('tb_products')
                        ->where('stock <= min_stock')
                        ->countAllResults();

                    $stats['lowStockItems'] = $db->table('tb_products')
                        ->select('id, name, stock, min_stock')
                        ->where('stock <= min_stock')
                        ->orderBy('stock', 'ASC')
                        ->limit(5)
                        ->get()
                        ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `tb_customers`
---
            }

            if ($db->tableExists('tb_customers')) {
                $stats['customers'] = (int) $db->table('tb_customers')->countAllResults();

SELECT DATE_FORMAT(date, '%Y-%m') AS period, COUNT(*) AS total
FROM `tb_transactions`
WHERE date IS NOT NULL
GROUP BY DATE_FORMAT(date, '%Y-%m')
---
    private function appendMonthlyChartData($db, array $stats, array $fields): array
    {
        $dateColumn = $this->pickTransactionDateColumn($fields);

        if ($dateColumn === null) {
            return $stats;
        }

        $labels = [];
        $totals = [];
        $map = [];

        for ($i = 5; $i >= 0; $i--) {
            $period = date('Y-m', strtotime('-' . $i . ' month'));
            $labels[] = date('M Y', strtotime($period . '-01'));
            $totals[] = 0;
            $map[$period] = count($labels) - 1;
        }

        $rows = $db->table('tb_transactions')
            ->select("DATE_FORMAT($dateColumn, '%Y-%m') AS period, COUNT(*) AS total", false)
            ->where("$dateColumn IS NOT NULL", null, false)
            ->groupBy("DATE_FORMAT($dateColumn, '%Y-%m')", false)
            ->get()
            ->getResultArray();