app/Controllers/Produk.php

    public function index()
    {
        $produkModel = new ProdukModel();

        $search     = trim((string) $this->request->getGet('search'));
        $categoryId = (int) $this->request->getGet('category_id');

        $db = Database::connect();

        $categories = $db->table('tb_categories')
            ->select('id, name')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `id`, `name`
FROM `tb_categories`
ORDER BY `name` ASC