app/Controllers/StokMasuk.php

SELECT `id`, `name`, `stock`, `min_stock`
FROM `tb_products`
ORDER BY `name` ASC
SELECT `id`, `name`
FROM `tb_suppliers`
ORDER BY `name` ASC
---
    public function index()
    {
        $db = Database::connect();

        $products = $db->table('tb_products')
            ->select('id, name, stock, min_stock')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();

        $lowStockProducts = array_values(array_filter($products, static function (array $product): bool {
            return (int) ($product['stock'] ?? 0) <= (int) ($product['min_stock'] ?? 0);
        }));

        usort($lowStockProducts, static function (array $a, array $b): int {
            return ((int) ($a['stock'] ?? 0)) <=> ((int) ($b['stock'] ?? 0));
        });

        $suppliers = $db->table('tb_suppliers')
            ->select('id, name')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();