app/Models/PrediksiModel.php

    public function getProdukList(): array
    {
        $db = Database::connect();

        if (! $db->tableExists('tb_products')) {
            return [];
        }

        return $db->table('tb_products')
            ->select('id, name')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `id`, `name`
FROM `tb_products`
ORDER BY `name` ASC

    private function loadFromTransactions($db, int $productId): array
    {
        $tFields = $db->getFieldNames('tb_transactions');
        $dateColumn = in_array('date', $tFields, true) ? 'date' : (in_array('transaction_date', $tFields, true) ? 'transaction_date' : null);

        if ($dateColumn === null) {
            return [];
        }

        $rows = $db->table('tb_transaction_details td')
            ->select("DATE_FORMAT(t.$dateColumn, '%Y-%m') AS period_key, DATE_FORMAT(MIN(t.$dateColumn), '%m/%Y') AS period_label, SUM(td.qty) AS qty", false)
            ->join('tb_transactions t', 't.id = td.transaction_id', 'inner')
            ->where('td.product_id', $productId)
            ->groupBy("DATE_FORMAT(t.$dateColumn, '%Y-%m')", false)
            ->orderBy('period_key', 'ASC')
            ->get()
            ->getResultArray();

        if (count($rows) >= 3) {
            return $this->mapSeriesRows($rows, 'period_label', 'qty');
        }

        // Fallback untuk data demo: gunakan urutan transaksi per produk jika data bulanan belum cukup.
        $rowsByTransaction = $db->table('tb_transaction_details td')
            ->select("t.id AS transaction_id, t.invoice_no, DATE_FORMAT(t.$dateColumn, '%d/%m/%Y') AS trx_date, SUM(td.qty) AS qty", false)
            ->join('tb_transactions t', 't.id = td.transaction_id', 'inner')
            ->where('td.product_id', $productId)
            ->groupBy('t.id, t.invoice_no, t.' . $dateColumn)
            ->orderBy('t.' . $dateColumn, 'ASC')
            ->orderBy('t.id', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT DATE_FORMAT(t.date, '%Y-%m') AS period_key, DATE_FORMAT(MIN(t.date), '%m/%Y') AS period_label, SUM(td.qty) AS qty
FROM `tb_transaction_details` `td`
INNER JOIN `tb_transactions` `t` ON `t`.`id` = `td`.`transaction_id`
WHERE `td`.`product_id` = 1
GROUP BY DATE_FORMAT(t.date, '%Y-%m')
ORDER BY `period_key` ASC
SELECT t.id AS transaction_id, t.invoice_no, DATE_FORMAT(t.date, '%d/%m/%Y') AS trx_date, SUM(td.qty) AS qty
FROM `tb_transaction_details` `td`
INNER JOIN `tb_transactions` `t` ON `t`.`id` = `td`.`transaction_id`
WHERE `td`.`product_id` = 1
GROUP BY `t`.`id`, `t`.`invoice_no`, `t`.`date`
ORDER BY `t`.`date` ASC, `t`.`id` ASC

    public function getHistoriesByCategory(int $categoryId): array
    {
        $db = Database::connect();

        if (! $db->tableExists('tb_transaction_details') || ! $db->tableExists('tb_transactions') || ! $db->tableExists('tb_products')) {
            return [];
        }

        $dateColumn = $this->getDateColumn($db, 'tb_transactions');
        if ($dateColumn === null) {
            return [];
        }

        $rows = $db->table('tb_transaction_details td')
            ->select("DATE_FORMAT(t.$dateColumn, '%Y-%m') AS period_key, DATE_FORMAT(MIN(t.$dateColumn), '%m/%Y') AS period_label, SUM(td.qty) AS qty", false)
            ->join('tb_transactions t', 't.id = td.transaction_id', 'inner')
            ->join('tb_products p', 'p.id = td.product_id', 'inner')
            ->where('p.category_id', $categoryId)
            ->groupBy("DATE_FORMAT(t.$dateColumn, '%Y-%m')", false)
            ->orderBy('period_key', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT DATE_FORMAT(t.date, '%Y-%m') AS period_key, DATE_FORMAT(MIN(t.date), '%m/%Y') AS period_label, SUM(td.qty) AS qty
FROM `tb_transaction_details` `td`
INNER JOIN `tb_transactions` `t` ON `t`.`id` = `td`.`transaction_id`
INNER JOIN `tb_products` `p` ON `p`.`id` = `td`.`product_id`
WHERE `p`.`category_id` = 1
GROUP BY DATE_FORMAT(t.date, '%Y-%m')
ORDER BY `period_key` ASC

    public function getTotalSalesHistory(): array
    {
        $db = Database::connect();

        if (! $db->tableExists('tb_transaction_details') || ! $db->tableExists('tb_transactions')) {
            return [];
        }

        $dateColumn = $this->getDateColumn($db, 'tb_transactions');
        if ($dateColumn === null) {
            return [];
        }

        $rows = $db->table('tb_transaction_details td')
            ->select("DATE_FORMAT(t.$dateColumn, '%Y-%m') AS period_key, DATE_FORMAT(MIN(t.$dateColumn), '%m/%Y') AS period_label, SUM(td.qty) AS qty", false)
            ->join('tb_transactions t', 't.id = td.transaction_id', 'inner')
            ->groupBy("DATE_FORMAT(t.$dateColumn, '%Y-%m')", false)
            ->orderBy('period_key', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT DATE_FORMAT(t.date, '%Y-%m') AS period_key, DATE_FORMAT(MIN(t.date), '%m/%Y') AS period_label, SUM(td.qty) AS qty
FROM `tb_transaction_details` `td`
INNER JOIN `tb_transactions` `t` ON `t`.`id` = `td`.`transaction_id`
GROUP BY DATE_FORMAT(t.date, '%Y-%m')
ORDER BY `period_key` ASC