app/Models/StokMasukModel.php

SELECT `s`.*, `p`.`name` AS `product_name`, `sp`.`name` AS `supplier_name`, `u`.`username` AS `username`
FROM `tb_stock_in` `s`
LEFT JOIN `tb_products` `p` ON `p`.`id` = `s`.`product_id`
LEFT JOIN `tb_suppliers` `sp` ON `sp`.`id` = `s`.`supplier_id`
LEFT JOIN `tb_users` `u` ON `u`.`id` = `s`.`user_id`
ORDER BY `s`.`id` DESC
---
    public function getHistory(?string $date = null): array
    {
        $builder = $this->db->table('tb_stock_in s')
            ->select('s.*, p.name AS product_name, sp.name AS supplier_name, u.username AS username')
            ->join('tb_products p', 'p.id = s.product_id', 'left')
            ->join('tb_suppliers sp', 'sp.id = s.supplier_id', 'left')
            ->join('tb_users u', 'u.id = s.user_id', 'left')
            ->orderBy('s.id', 'DESC');

        if ($date !== null && $date !== '') {
            $builder->where('s.date', $date);
        }

        return $builder->get()->getResultArray();