app/Models/UserModel.php

    public function getUserByUsername(string $username): ?array
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `tb_users`
WHERE `username` = 'admin'
 LIMIT 1