app/Libraries/AdvancedPredictionService.php

    protected function getTopProductForecasts(int $limit = 10): array
    {
        $products = $this->db->table('tb_products')
            ->select('id, name')
            ->orderBy('id', 'ASC')
            ->limit($limit)
            ->get()
            ->getResultArray();
---
SELECT `id`, `name`
FROM `tb_products`
ORDER BY `id` ASC
 LIMIT 10

    protected function getTopCategories(int $limit = 5): array
    {
        if (! $this->db->tableExists('tb_categories')) {
            return [];
        }

        return $this->db->table('tb_categories')
            ->select('id, name')
            ->orderBy('id', 'ASC')
            ->limit($limit)
            ->get()
            ->getResultArray();
---
SELECT `id`, `name`
FROM `tb_categories`
ORDER BY `id` ASC
 LIMIT 5